app/views/registers/_form.html.erb

      <br>
      <%= f.select :semester_no, Register::SEMESTER_TYPES,
                   prompt: 'Select a Semester' %>
---
SELECT "registers".* FROM "registers" WHERE (student_id_card == 'IT08011') ORDER BY "registers"."id" DESC LIMIT 1