app/views/shared/_drop_down_options.html.erb

SELECT "subjects".* FROM "subjects"
---
$(".dynamic_subject").html('<%= label_tag :subjects %>:<br><%unless @previous_subjects.blank?%><% @previous_subjects.each do |subject| %><%= label_tag subject %>:<%= check_box_tag "register[subject_name][]", subject, true %> <br/><% end %><% end %><%unless @subject_options.blank?%><% @subject_options.each do |subject| %><%= label_tag subject %>:<%= check_box_tag "register[subject_name][]", subject %> <br/><% end %><% end %>');