app/views/subjects/_form.html.erb

    <%= f.label :semester_no %><br>
    <% Semester.count.times do |i| %>
---
SELECT COUNT(*) FROM "semesters"