app/controllers/registers_controller.rb

SELECT 1 AS one FROM "registers" WHERE (student_id_card == 'IT09002') LIMIT 1
---
  def create
    @register = Register.new(register_params)
    #@register = Register.find(params[:id])
    subject = Subject.find_all_by_semester_no(@register.semester_no)
    #Use val to find records

    @options = subject.collect{|x| "#{x.subject_name}" }

    student_id_no = params[:register][:student_id_card]
    semester_no = params[:register][:semester_no]
    subject_nam = params[:register][:subject_name]

    err = false
    if subject_nam.blank?