app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @registration = Registration.find(params[:id])

SELECT "subjects".* FROM "subjects" WHERE (Subject.semester_no == 1)
INSERT INTO "registrations" ("created_at", "semester_no", "student_id_card_no", "student_name", "subject_no_1", "subject_no_2", "subject_no_3", "subject_no_4", "subject_no_5", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@registration = Registration.new(registration_params)

    subject = Subject.all
    #Use val to find records

    @options = subject.collect{|x| "#{x.subject_name}" }

    subs = ["subject_no_1","subject_no_2","subject_no_3","subject_no_4","subject_no_5"]
    student_id_no = params[:registration][:student_id_card_no]
    student_nam = params[:registration][:student_name]
    semester_no = params[:registration][:semester_no]
    subject_nam = params[:registration][:subject_name]

    err = false
      @registration = Registration.new({semester_no: semester_no, student_name: student_nam, student_id_card_no: student_id_no, subject_no_1: subject_nam[0], subject_no_2: subject_nam[1], subject_no_3: subject_nam[2], subject_no_4: subject_nam[3], subject_no_5: subject_nam[4] })
      unless @registration.save

DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 24]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."student_id_card_no" = 'IT08009'
INSERT INTO "registrations" ("created_at", "semester_no", "student_id_card_no", "student_name", "subject_no_1", "subject_no_2", "subject_no_3", "subject_no_4", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def update

    student_id_no = params[:registration][:student_id_card_no]
    student_nam = params[:registration][:student_name]
    semester_no = params[:registration][:semester_no]
    subject_nam = params[:registration][:subject_name]

    err = false
    Registration.where(:student_id_card_no => student_id_no).destroy_all
    @registration = Registration.new({semester_no: semester_no, student_name: student_nam, student_id_card_no: student_id_no, subject_no_1: subject_nam[0], subject_no_2: subject_nam[1], subject_no_3: subject_nam[2], subject_no_4: subject_nam[3], subject_no_5: subject_nam[4] })
      unless @registration.save

DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 1]]
---
  def destroy
    @registration.destroy

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_registration
      @registration = Registration.find(params[:id])