app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers"

  def edit
    @register = Register.find(params[:id])

    subject = Subject.find_all_by_semester_no(@register.semester_no)
---
SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."semester_no" = 113

  def create
    @register = Register.new(register_params)
    #@register = Register.find(params[:id])
    subject = Subject.find_all_by_semester_no(@register.semester_no)          #find subjects from SUBJECT table based on semester_no
    #Use val to find records
    @previous_subjects = []                                                   #subjects that are already taken to this semester
    @subject_options = subject.collect { |x| "#{x.subject_name}" }            #subjects available to take in this semester
    @registration = Register.all
    @registration.each do |element|                                           #listing the available & editable subjects
      if element.student_id_card == @register.student_id_card
        if element.semester_no == @register.semester_no
          @subject_options.delete(element.subject_name)
          @previous_subjects.push(element.subject_name)
---
SELECT "registers".* FROM "registers" WHERE (student_id_card == 'IT09002') AND (semester_no == 7)
SELECT "subjects".* FROM "subjects" WHERE "subjects"."semester_no" = 5
SELECT "subjects".* FROM "subjects"
SELECT "registers".* FROM "registers" WHERE (student_id_card == 'IT09011') ORDER BY "registers"."id" DESC LIMIT 1
INSERT INTO "registers" ("created_at", "semester_no", "student_id_card", "subject_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 25 Sep 2013 12:58:31 UTC +00:00], ["semester_no", 2], ["student_id_card", "IT09010"], ["subject_name", "C Project"], ["updated_at", Wed, 25 Sep 2013 12:58:31 UTC +00:00]]

  def update

    @register = Register.find(params[:id])

    subject = Subject.find_all_by_semester_no(@register.semester_no)
    #Use val to find records
    @previous_subjects = []
    @subject_options = subject.collect { |x| "#{x.subject_name}" }
    @registration = Register.all
    @registration.each do |element|
      if element.student_id_card == @register.student_id_card
        if element.semester_no == @register.semester_no
          @subject_options.delete(element.subject_name)
          @previous_subjects.push(element.subject_name)
---
SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "registers".* FROM "registers" WHERE "registers"."semester_no" = 1
SELECT "subjects".* FROM "subjects"
DELETE FROM "registers" WHERE "registers"."id" = ?  [["id", 3]]
INSERT INTO "registers" ("created_at", "semester_no", "student_id_card", "subject_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 25 Sep 2013 13:47:22 UTC +00:00], ["semester_no", 6], ["student_id_card", "IT09002"], ["subject_name", "Microwave 2"], ["updated_at", Wed, 25 Sep 2013 13:47:22 UTC +00:00]]

  def destroy
    @register.destroy
---
DELETE FROM "registers" WHERE "registers"."id" = ?  [["id", 2]]

  def set_register
    @register = Register.find(params[:id])
---
SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? AND (student_id_card == 'IT09002') LIMIT 1  [["id", 3]]