app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.all
---
SELECT "semesters".* FROM "semesters"

  def create
    @semester = Semester.new(semester_params)

    respond_to do |format|
      if @semester.save
---
INSERT INTO "semesters" ("created_at", "semester_no", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 13 Sep 2013 05:45:51 UTC +00:00], ["semester_no", 1], ["updated_at", Fri, 13 Sep 2013 05:45:51 UTC +00:00]]

  def update
    respond_to do |format|
      if @semester.update(semester_params)
---
UPDATE "semesters" SET "semester_no" = ?, "updated_at" = ? WHERE "semesters"."id" = 5  [["semester_no", 15], ["updated_at", Fri, 20 Sep 2013 12:34:47 UTC +00:00]]

  def destroy
    @semester.destroy
---
DELETE FROM "semesters" WHERE "semesters"."id" = ?  [["id", 8]]

  def get_drop_down_options

    val = params[:id]
    subject = Subject.find_all_by_semester_no(val)
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."semester_no" = 2

    def set_semester
      @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "8"]]