app/controllers/subjects_controller.rb

  def create
  @subject = Subject.new(subject_params)

  subject_nam = params[:subject][:subject_name]
  semester_no = params[:subject][:semester_no]

  #semester_nos = params[:subject][:subject_name]

    err = false
    unless semester_nos.blank?
    semester_no.each do |semester|
      @subjects = Subject.new({semester_no: semester, subject_name: subject_nam})
      unless @subjects.save
---
INSERT INTO "subjects" ("created_at", "semester_no", "subject_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 13 Sep 2013 05:53:07 UTC +00:00], ["semester_no", 1], ["subject_name", "C Programming"], ["updated_at", Fri, 13 Sep 2013 05:53:07 UTC +00:00]]

  def update

    @subject = Subject.find(params[:id])
    semester_no = params[:subject][:semester_no]
    subject_name = @subject.subject_name

    err = false
    semester_no.each do |semester|
      unless Subject.exists?({semester_no: semester, subject_name: subject_name})
        @subject = Subject.new({semester_no: semester, subject_name: subject_name})
        unless @subject.save
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "3"]]
SELECT 1 AS one FROM "subjects" WHERE "subjects"."semester_no" = 3 AND "subjects"."subject_name" = 'Java' LIMIT 1
INSERT INTO "subjects" ("created_at", "semester_no", "subject_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 22 Sep 2013 04:28:51 UTC +00:00], ["semester_no", 7], ["subject_name", "E-Commerce"], ["updated_at", Sun, 22 Sep 2013 04:28:51 UTC +00:00]]
UPDATE "subjects" SET "subject_name" = ?, "updated_at" = ? WHERE "subjects"."id" = 3  [["subject_name", "Electronics 1"], ["updated_at", Fri, 13 Sep 2013 05:54:56 UTC +00:00]]

  def destroy
    @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 33]]